# DBeam_SetTShutDepth

```pascal
PROCEDURE DBeam_SetTShutDepth(depth : INTEGER);
```

```python
def vs.DBeam_SetTShutDepth(depth):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|depth|INTEGER|   |

## Examples
```pascal
DBeam_SetTShutDepth(1);
```
```python
import vs

depth = 1

vs.DBeam_SetTShutDepth(depth)
```

## Version
Availability: from Vectorworks 2011

## Category
* Spotlight